# Pandas Tutorial

In [8]:
import pandas as pd

In [9]:
!pip install

Defaulting to user installation because normal site-packages is not writeable

ERROR: You must give at least one requirement to install (see "pip help install")

In [10]:
#pandas version
print(pd.__version__)

2.2.2

# Series Create,Manipulate,querry,Delete

In [12]:
# Creating series
name=["Demon","Trio","Naruto","Roman"]
s1=pd.Series(name)
s1

0     Demon
1      Trio
2    Naruto
3     Roman
dtype: object

In [13]:
sequence=[1,2,3,4]
s2=pd.Series(name,index=sequence)
s2

1     Demon
2      Trio
3    Naruto
4     Roman
dtype: object

In [14]:
import numpy as np
n=np.random.randn(7)
index=['1st_val','2nd_val','3rd_val','4th_val','5th_val','6th_val','7th_val']
s3=pd.Series(n,index=index)
s3

1st_val   -0.423589
2nd_val   -0.696846
3rd_val   -0.441289
4th_val    0.941664
5th_val   -0.890412
6th_val    0.418899
7th_val    0.954467
dtype: float64

In [15]:
d={"name":['DEMON','TRIO','NARUTIO','ROMAN']}
s_4=pd.Series(d)
s_4

name    [DEMON, TRIO, NARUTIO, ROMAN]
dtype: object

In [16]:
type(s_4)

pandas.core.series.Series

In [17]:
#creating series from dictionary
d1={"a":7,"b":77,"c":777}
x1=pd.Series(d1)
x1

a      7
b     77
c    777
dtype: int64

In [18]:
#modify the index of series
s1.index=["x","y","z","a"]
s1

x     Demon
y      Trio
z    Naruto
a     Roman
dtype: object

In [19]:
#creating series using list
l=["DEMON","ROMAN","NARUTO","TRIO","Kakashi","Hasirama","Madara"]
s=pd.Series(l)
s

0       DEMON
1       ROMAN
2      NARUTO
3        TRIO
4     Kakashi
5    Hasirama
6      Madara
dtype: object

# Slicing

In [21]:
s[:4]

0     DEMON
1     ROMAN
2    NARUTO
3      TRIO
dtype: object

In [22]:
s[:-1]

0       DEMON
1       ROMAN
2      NARUTO
3        TRIO
4     Kakashi
5    Hasirama
dtype: object

In [23]:
y=pd.Series([1,2,3,4])
z=[2,3,4,7]

In [24]:
y

0    1
1    2
2    3
3    4
dtype: int64

In [25]:
index=["a","b","c","d"]
z_1=pd.Series(z,index=index)
z_1

a    2
b    3
c    4
d    7
dtype: int64

In [26]:
x=pd.concat([y,z_1])
x

0    1
1    2
2    3
3    4
a    2
b    3
c    4
d    7
dtype: int64

In [27]:
x.drop('c')

0    1
1    2
2    3
3    4
a    2
b    3
d    7
dtype: int64

# Series Operation

In [29]:
l1=[1,2,3,4,5,6]
l2=[7,8,9,10]

In [30]:
s_1=pd.Series(l1)
s_1

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [31]:
s_2=pd.Series(l2)
s_2

0     7
1     8
2     9
3    10
dtype: int64

In [32]:
s_1.add(s_2)

0     8.0
1    10.0
2    12.0
3    14.0
4     NaN
5     NaN
dtype: float64

In [33]:
s_1.sub(s_2)

0   -6.0
1   -6.0
2   -6.0
3   -6.0
4    NaN
5    NaN
dtype: float64

In [34]:
s_1.mul(s_2)

0     7.0
1    16.0
2    27.0
3    40.0
4     NaN
5     NaN
dtype: float64

In [35]:
s_1.div(s_2)

0    0.142857
1    0.250000
2    0.333333
3    0.400000
4         NaN
5         NaN
dtype: float64

In [36]:
print("Median",s_2.median())
print("Maximum",s_1.max())
print("Minimum",s_1.min())

Median 8.5
Maximum 6
Minimum 1

# DataFrame

In [38]:
date=pd.date_range('today',periods=7)
date

DatetimeIndex(['2024-11-10 12:20:32.660134', '2024-11-11 12:20:32.660134',
               '2024-11-12 12:20:32.660134', '2024-11-13 12:20:32.660134',
               '2024-11-14 12:20:32.660134', '2024-11-15 12:20:32.660134',
               '2024-11-16 12:20:32.660134'],
              dtype='datetime64[ns]', freq='D')

In [39]:
num_arr=np.random.randn(7,4)
columns=['A','B','C','D']
df1=pd.DataFrame(num_arr,index=date,columns=columns)
df1

                                   A         B         C         D
2024-11-10 12:20:32.660134  0.214694 -2.102841  1.684711  1.103730
2024-11-11 12:20:32.660134  1.157646  0.142838 -0.970640  0.447524
2024-11-12 12:20:32.660134  0.953690 -0.342970 -0.065576  0.502173
2024-11-13 12:20:32.660134  0.028854  0.681780  0.451821 -0.779449
2024-11-14 12:20:32.660134  0.394028  1.559451 -1.005721  0.447021
2024-11-15 12:20:32.660134 -2.410970 -0.384722 -1.103135 -1.067410
2024-11-16 12:20:32.660134  1.074513  1.605592  0.815128 -0.689664

In [40]:
df1.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [41]:
df1.head()

                                   A         B         C         D
2024-11-10 12:20:32.660134  0.214694 -2.102841  1.684711  1.103730
2024-11-11 12:20:32.660134  1.157646  0.142838 -0.970640  0.447524
2024-11-12 12:20:32.660134  0.953690 -0.342970 -0.065576  0.502173
2024-11-13 12:20:32.660134  0.028854  0.681780  0.451821 -0.779449
2024-11-14 12:20:32.660134  0.394028  1.559451 -1.005721  0.447021

In [42]:
#creating dataframe with dictionary
stdata={"Name":["Deepak","Demon","Trio","Naruto","LivMorgan","Roman"],
        "Age":[20,21,19,17,23,24],
        "Mark":[80,76,95,86,89,90]}
sno=[1,2,3,4,5,6]
df_2=pd.DataFrame(stdata,index=sno)
df_2

        Name  Age  Mark
1     Deepak   20    80
2      Demon   21    76
3       Trio   19    95
4     Naruto   17    86
5  LivMorgan   23    89
6      Roman   24    90

In [43]:
df_2.dtypes

Name    object
Age      int64
Mark     int64
dtype: object

In [44]:
df_2.head()

        Name  Age  Mark
1     Deepak   20    80
2      Demon   21    76
3       Trio   19    95
4     Naruto   17    86
5  LivMorgan   23    89

In [45]:
df_2.describe()

             Age       Mark
count   6.000000   6.000000
mean   20.666667  86.000000
std     2.581989   6.957011
min    17.000000  76.000000
25%    19.250000  81.500000
50%    20.500000  87.500000
75%    22.500000  89.750000
max    24.000000  95.000000

In [46]:
df_2.shape

(6, 3)

In [47]:
df_2.size

18

In [48]:
df_2.columns

Index(['Name', 'Age', 'Mark'], dtype='object')

In [49]:
df_2.T

           1      2     3       4          5      6
Name  Deepak  Demon  Trio  Naruto  LivMorgan  Roman
Age       20     21    19      17         23     24
Mark      80     76    95      86         89     90

In [50]:
df_2.sort_values(by='Mark',ascending=False)

        Name  Age  Mark
3       Trio   19    95
6      Roman   24    90
5  LivMorgan   23    89
4     Naruto   17    86
1     Deepak   20    80
2      Demon   21    76

In [51]:
#slicing dataframe
df_2[0:3]

     Name  Age  Mark
1  Deepak   20    80
2   Demon   21    76
3    Trio   19    95

In [52]:
#query dataframe by tag
df_2[['Age','Mark']]

   Age  Mark
1   20    80
2   21    76
3   19    95
4   17    86
5   23    89
6   24    90

In [53]:
df_2.iloc[1:3]

    Name  Age  Mark
2  Demon   21    76
3   Trio   19    95

In [54]:
df3=df_2.copy()
df3

        Name  Age  Mark
1     Deepak   20    80
2      Demon   21    76
3       Trio   19    95
4     Naruto   17    86
5  LivMorgan   23    89
6      Roman   24    90

In [55]:
df3.isnull()

    Name    Age   Mark
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False  False

In [56]:
df3.isna().sum()

Name    0
Age     0
Mark    0
dtype: int64

In [57]:
# Modify values
df3.loc[1,"Mark"]=90
df3

        Name  Age  Mark
1     Deepak   20    90
2      Demon   21    76
3       Trio   19    95
4     Naruto   17    86
5  LivMorgan   23    89
6      Roman   24    90

In [58]:
df3[["Mark"]].mean()

Mark    87.666667
dtype: float64

In [59]:
df3.sum()

Name    DeepakDemonTrioNarutoLivMorganRoman
Age                                     124
Mark                                    526
dtype: object

In [60]:
df3[["Mark"]].min()

Mark    76
dtype: int64

In [61]:
df3[["Mark"]].max()

Mark    95
dtype: int64

# operations for DataFrame Missing Values

In [63]:
dic={"Name":["Deepak","Demon","Trio","Livmorgan","Roman"],
     "Tamil_mark":[90,76,97,87,80],
     "English_mark":[75,np.nan,89,76,78],
     "Maths_mark":[75,67,98,78,np.nan],
     "computermark":[89,np.nan,90,78,np.nan]}
dic

{'Name': ['Deepak', 'Demon', 'Trio', 'Livmorgan', 'Roman'],
 'Tamil_mark': [90, 76, 97, 87, 80],
 'English_mark': [75, nan, 89, 76, 78],
 'Maths_mark': [75, 67, 98, 78, nan],
 'computermark': [89, nan, 90, 78, nan]}

In [117]:
ndf=pd.DataFrame(dic)
ndf

        Name  Tamil_mark  English_mark  Maths_mark  computermark
0     Deepak          90          75.0        75.0          89.0
1      Demon          76           NaN        67.0           NaN
2       Trio          97          89.0        98.0          90.0
3  Livmorgan          87          76.0        78.0          78.0
4      Roman          80          78.0         NaN           NaN

In [119]:
ndf.fillna(70)

        Name  Tamil_mark  English_mark  Maths_mark  computermark
0     Deepak          90          75.0        75.0          89.0
1      Demon          76          70.0        67.0          70.0
2       Trio          97          89.0        98.0          90.0
3  Livmorgan          87          76.0        78.0          78.0
4      Roman          80          78.0        70.0          70.0

In [140]:
nMark=ndf['English_mark'].mean()
ndf2=pd.DataFrame(ndf['English_mark'].fillna(nMark))

In [142]:
ndf2

   English_mark
0          75.0
1          79.5
2          89.0
3          76.0
4          78.0

In [144]:
ndf.dropna(how='any')

        Name  Tamil_mark  English_mark  Maths_mark  computermark
0     Deepak          90          75.0        75.0          89.0
2       Trio          97          89.0        98.0          90.0
3  Livmorgan          87          76.0        78.0          78.0

# DataFrame File Operation

In [147]:
ndf.to_csv('student.csv')

In [152]:
df_st=pd.read_csv('student.csv')
df_st

   Unnamed: 0       Name  Tamil_mark  English_mark  Maths_mark  computermark
0           0     Deepak          90          75.0        75.0          89.0
1           1      Demon          76           NaN        67.0           NaN
2           2       Trio          97          89.0        98.0          90.0
3           3  Livmorgan          87          76.0        78.0          78.0
4           4      Roman          80          78.0         NaN           NaN

In [154]:
df_st.head()

   Unnamed: 0       Name  Tamil_mark  English_mark  Maths_mark  computermark
0           0     Deepak          90          75.0        75.0          89.0
1           1      Demon          76           NaN        67.0           NaN
2           2       Trio          97          89.0        98.0          90.0
3           3  Livmorgan          87          76.0        78.0          78.0
4           4      Roman          80          78.0         NaN           NaN

In [174]:
df_st.describe()

       Unnamed: 0  Tamil_mark  English_mark  Maths_mark  computermark
count    5.000000    5.000000      4.000000    4.000000      3.000000
mean     2.000000   86.000000     79.500000   79.500000     85.666667
std      1.581139    8.276473      6.454972   13.178265      6.658328
min      0.000000   76.000000     75.000000   67.000000     78.000000
25%      1.000000   80.000000     75.750000   73.000000     83.500000
50%      2.000000   87.000000     77.000000   76.500000     89.000000
75%      3.000000   90.000000     80.750000   83.000000     89.500000
max      4.000000   97.000000     89.000000   98.000000     90.000000

In [160]:
df_st.shape

(5, 6)

In [162]:
df_st.size

30

In [164]:
df_st.isna().sum()

Unnamed: 0      0
Name            0
Tamil_mark      0
English_mark    1
Maths_mark      1
computermark    2
dtype: int64

In [176]:
ndf.to_excel('std.xlsx',sheet_name='Student_performance')
df_st2=pd.read_excel('std.xlsx','Student_performance',index_col=None,na_values=['NA'])
df_st2

   Unnamed: 0       Name  Tamil_mark  English_mark  Maths_mark  computermark
0           0     Deepak          90          75.0        75.0          89.0
1           1      Demon          76           NaN        67.0           NaN
2           2       Trio          97          89.0        98.0          90.0
3           3  Livmorgan          87          76.0        78.0          78.0
4           4      Roman          80          78.0         NaN           NaN